delphi-learnnote-source-code-analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-03 五 18:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Delphi源码学习与分析</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/worg.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Delphi源码学习与分析</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd55f541">1. </a></li>
<li><a href="#orgf3a95fa">2. Rust部分代码分析</a>
<ul>
<li><a href="#org03756a5">2.1. algebra：</a>
<ul>
<li><a href="#orgb4f5d25">2.1.1. Polynomial</a></li>
<li><a href="#org861ab2b">2.1.2. bytes</a></li>
<li><a href="#orge4d32fa">2.1.3. biginteger</a></li>
<li><a href="#orge2fae2c">2.1.4. fixed_point</a></li>
<li><a href="#org2abd555">2.1.5. fields</a></li>
<li><a href="#orgfb40669">2.1.6. 其他</a></li>
</ul>
</li>
<li><a href="#org0c0e53f">2.2. crypto-primitives</a>
<ul>
<li><a href="#orgfa99caa">2.2.1. additive_share</a></li>
<li><a href="#orgcac819c">2.2.2. beavers_mul</a></li>
<li><a href="#org22c5b83">2.2.3. gc (garbled circuits)</a></li>
</ul>
</li>
<li><a href="#org479da87">2.3. neural-network</a>
<ul>
<li><a href="#org0114f29">2.3.1. layers</a></li>
<li><a href="#org9fe2f64">2.3.2. tensors</a></li>
<li><a href="#orge6473cf">2.3.3. others</a></li>
</ul>
</li>
<li><a href="#orgef52f77">2.4. protocols-sys</a>
<ul>
<li><a href="#org4c30e6e">2.4.1. client_cg</a></li>
<li><a href="#orgf638af0">2.4.2. client_gen</a></li>
<li><a href="#org9a3c853">2.4.3. key_share</a></li>
<li><a href="#orge32a96d">2.4.4. server_cg</a></li>
<li><a href="#org11f4848">2.4.5. server_gen</a></li>
<li><a href="#orgeacb509">2.4.6. others</a></li>
</ul>
</li>
<li><a href="#org3b1356e">2.5. protocols</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd55f541" class="outline-2">
<h2 id="orgd55f541"><span class="section-number-2">1.</span> </h2>
</div>
<div id="outline-container-orgf3a95fa" class="outline-2">
<h2 id="orgf3a95fa"><span class="section-number-2">2.</span> Rust部分代码分析</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org03756a5" class="outline-3">
<h3 id="org03756a5"><span class="section-number-3">2.1.</span> algebra：</h3>
<div class="outline-text-3" id="text-2-1">
<p>
algebra文件夹提供了基本的代数操作，主要包括：
</p>
<ol class="org-ol">
<li>如何将一个整数表示为二进制流，以及对应的数字的写入写出</li>
<li>大整数</li>
<li>多项式操作</li>
<li>固定点</li>
<li>域相关</li>
</ol>

<p>
从中可以看出，algebra中不涉及到加密解密算法，仅仅是定义一些基本的结构和操作。
</p>
</div>

<div id="outline-container-orgb4f5d25" class="outline-4">
<h4 id="orgb4f5d25"><span class="section-number-4">2.1.1.</span> Polynomial</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>struct
<ol class="org-ol">
<li>Plymomial:该结构体主要用来存储多项式的参数，Vec&lt;F&gt;</li>
<li>方法：唯一值得重视的是evalute,给定一组二进制向量，计算带入多项式的结果</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org861ab2b" class="outline-4">
<h4 id="org861ab2b"><span class="section-number-4">2.1.2.</span> bytes</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
整数数据的二进制形式的读取与写入
</p>

<ol class="org-ol">
<li>trait   ToBytes, FromBytes:写入成byte，读取一个byte</li>
<li>macro
<ol class="org-ol">
<li>array_bytes,该宏用于负责u8,u16 u32 u64等数据的二进制的写入写出</li>
<li>to_bytes:</li>
<li>push_to_vec:</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orge4d32fa" class="outline-4">
<h4 id="orge4d32fa"><span class="section-number-4">2.1.3.</span> biginteger</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>traits
<ol class="org-ol">
<li>BigInteger，除了byte写入写出的操作，就是字节遍历的操作和各类数学运算</li>
<li>BigInteger32</li>
<li>BigInteger64</li>
</ol></li>
<li>mod
<ol class="org-ol">
<li>arithmetic，封装了一些算术运算，不知道具体在哪里使用的</li>
<li>adc, carry=a+b+carry</li>
<li>sbb: borrow=a-b-borrow</li>
<li>mac_with_carry: carry=a+b*c+carry</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orge2fae2c" class="outline-4">
<h4 id="orge2fae2c"><span class="section-number-4">2.1.4.</span> fixed_point</h4>
<div class="outline-text-4" id="text-2-1-4">
<ol class="org-ol">
<li>trait
<ol class="org-ol">
<li>FixedPointParameters：为一个固定点设置的参数
<ol class="org-ol">
<li>参数包括：MANTISSA_CAPACITY, EXPONENT_CAPACITY</li>
<li>函数：truncate_float</li>
</ol></li>
</ol></li>
<li>Struct
<ol class="org-ol">
<li>FixedPoint
<ol class="org-ol">
<li>参数：inner， inner满足域的性质。num_muls, u8。\_params: phantomdata类型的一个FixedPointParameters</li>
<li>&#x2026;</li>
</ol></li>
</ol></li>
</ol>

<p>
相关的操作运算：
</p>
<ol class="org-ol">
<li>One</li>
<li>Zero</li>
<li>PhantomData</li>
<li>Add,AddAssign</li>
<li>Mul,M&#x2026;</li>
<li>Neg</li>
<li>Sub,S&#x2026;</li>
</ol>
</div>
</div>
<div id="outline-container-org2abd555" class="outline-4">
<h4 id="org2abd555"><span class="section-number-4">2.1.5.</span> fields</h4>
<div class="outline-text-4" id="text-2-1-5">
<ol class="org-ol">
<li>trait
<ol class="org-ol">
<li>Field,一个域满足很多数学计算性质，除此之外还有编程上的一些性质,无参数</li>
<li>FpParameters, 有限域所涉及到的参数集合。所涉及到的变量
<ol class="org-ol">
<li>模数（modulus）,模数的位数</li>
<li>shave bits</li>
<li>R，R^2，INVariant</li>
<li>generator,一个乘法生成器，也是一个二次非剩余</li>
<li>capacity,</li>
<li>others&#x2026;</li>
</ol></li>
<li>PrimeField,素数域的trait，包含如下的函数集合：
<ol class="org-ol">
<li>from_repr,into_repr，即根据一个大数构造一个有效域出来</li>
<li>from_random_bytes，根据一个bytes返回有限域中的一个元素</li>
<li>characteristic，不知道，实现上返回了模数</li>
<li>&#x2026;</li>
</ol></li>
<li>SquareRootField,支持高效的平方根操作的field,包含以下函数：
<ol class="org-ol">
<li>legendre,返回勒让得符号</li>
<li>sqrt,&#x2026;，平方根操作相关</li>
</ol></li>
</ol></li>
<li>其他</li>
<li>枚举变量勒让德符号，包括0,平方根剩余、平方根非剩余三种</li>
<li>BitIterator,结构体包含变量的指针及其长度，可以遍历</li>
<li>macros
<ol class="org-ol">
<li>impl_filed_into_bigint:为大数构建对应的有限域！</li>
</ol></li>
<li>函数
<ol class="org-ol">
<li>batch_inversion: AES算法中涉及到的inversion操作</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgfb40669" class="outline-4">
<h4 id="orgfb40669"><span class="section-number-4">2.1.6.</span> 其他</h4>
<div class="outline-text-4" id="text-2-1-6">
<ol class="org-ol">
<li>trait
<ol class="org-ol">
<li>UniformRandom
<ol class="org-ol">
<li>包含有一个函数，uniform。给定一个随机数，返回自身。</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org0c0e53f" class="outline-3">
<h3 id="org0c0e53f"><span class="section-number-3">2.2.</span> crypto-primitives</h3>
<div class="outline-text-3" id="text-2-2">
<p>
加密运算环节主要实现了三种简单的加密运算，分别是additive_share，beavers_mul以及garbled circuits。其中加法的共享主要用来进行线性的加密运算，beavers mul主要用来进行乘法同态运算，而gc则用来进行非线性激活函数的运算。
</p>

<p>
TODO beavers_mul缺少介绍
</p>
</div>
<div id="outline-container-orgfa99caa" class="outline-4">
<h4 id="orgfa99caa"><span class="section-number-4">2.2.1.</span> additive_share</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>trait
<ol class="org-ol">
<li>Share，一个复杂的trait，本身是一个变量，包含以下函数：
<ol class="org-ol">
<li>share，将一个随机数一分为两个AdditiveShare变量</li>
<li>share_with_randomness，完成1所用</li>
<li>randomize_local_share(&amp;AdditiveShare&lt;Self&gt;,&amp;self::Ring)，使用ring将当前的share岁计划.</li>
</ol></li>
</ol></li>
<li>Struct
<ol class="org-ol">
<li>AdditiveShare,结构体,只有一个share类型的参数inner.方法包括：
<ol class="org-ol">
<li>combine，解密</li>
<li>add_constant&#x2026;</li>
</ol></li>
<li>ShareIterator, 顾名思义，Share的一个iterator</li>
</ol></li>
<li>others
<ol class="org-ol">
<li>类型：FixedPoint&lt;FixedPointparameters&gt;
<ol class="org-ol">
<li>From &lt;Additiveshare&lt;FixedPoint&lt;Fixedpointparameters&gt;&gt;&gt; 函数</li>
<li>为FixedPoint&lt;FixedPointparameters&gt; 实现Share trait
<ol class="org-ol">
<li>此时，Ring便是Field，constant类型与FixedPoint&lt;FixedPointparameters&gt;相同</li>
</ol></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgcac819c" class="outline-4">
<h4 id="orgcac819c"><span class="section-number-4">2.2.2.</span> beavers_mul</h4>
<div class="outline-text-4" id="text-2-2-2">
<ol class="org-ol">
<li>struct</li>
</ol>

<p>
略
</p>
</div>
</div>
<div id="outline-container-org22c5b83" class="outline-4">
<h4 id="org22c5b83"><span class="section-number-4">2.2.3.</span> gc (garbled circuits)</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
略
</p>
</div>
</div>
</div>


<div id="outline-container-org479da87" class="outline-3">
<h3 id="org479da87"><span class="section-number-3">2.3.</span> neural-network</h3>
<div class="outline-text-3" id="text-2-3">
<p>
neural-network主要封装了：
</p>
<ol class="org-ol">
<li>fc,conv等线性层</li>
<li>relu，relu的多项式近似等非线性层</li>
<li>input,output的additive share实现</li>
<li>layer和neural network的抽象</li>
</ol>
</div>

<div id="outline-container-org0114f29" class="outline-4">
<h4 id="org0114f29"><span class="section-number-4">2.3.1.</span> layers</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>LayerDims, 包含inputdims和outputdims</li>
<li>Layer, 包含线性和非线性</li>
<li>LayerInfo, 包含layerdims和linearlayerinfo等东西</li>
</ol>
<p>
其中linearlayer包含如下：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #C68EDE;">pub</span> <span style="color: #C68EDE;">enum</span> <span style="color: #6bd9db;">LinearLayer</span><span style="color: #a0586c;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #a0586c;">&gt;</span> <span style="color: #a0586c;">{</span>
    <span style="color: #6bd9db;">Conv2d</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">dims</span>: <span style="color: #6bd9db;">LayerDims</span>,
        <span style="color: #9587DD;">params</span>: <span style="color: #6bd9db;">Conv2dParams</span><span style="color: #9587DD;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #9587DD;">&gt;</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">FullyConnected</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">dims</span>: <span style="color: #6bd9db;">LayerDims</span>,
        <span style="color: #9587DD;">params</span>: <span style="color: #6bd9db;">FullyConnectedParams</span><span style="color: #9587DD;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #9587DD;">&gt;</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">FullyConnectedD</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">dims</span>: <span style="color: #6bd9db;">LayerDims</span>,
        <span style="color: #9587DD;">params</span>: <span style="color: #6bd9db;">FullyConnectedParamsD</span><span style="color: #9587DD;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #9587DD;">&gt;</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">AvgPool</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">dims</span>: <span style="color: #6bd9db;">LayerDims</span>,
        <span style="color: #9587DD;">params</span>: <span style="color: #6bd9db;">AvgPoolParams</span><span style="color: #9587DD;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #9587DD;">&gt;</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">Identity</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">dims</span>: <span style="color: #6bd9db;">LayerDims</span>,
    <span style="color: #9d81ba;">}</span>,
<span style="color: #a0586c;">}</span>
</pre>
</div>

<p>
linear layer info包含如下：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #C68EDE;">pub</span> <span style="color: #C68EDE;">enum</span> <span style="color: #6bd9db;">LinearLayerInfo</span><span style="color: #a0586c;">&lt;</span><span style="color: #6bd9db;">F</span>, <span style="color: #6bd9db;">C</span><span style="color: #a0586c;">&gt;</span> <span style="color: #a0586c;">{</span>
    <span style="color: #6bd9db;">Conv2d</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">kernel</span>: <span style="color: #9587DD;">(</span><span style="color: #6bd9db;">usize</span>, <span style="color: #6bd9db;">usize</span>, <span style="color: #6bd9db;">usize</span>, <span style="color: #6bd9db;">usize</span><span style="color: #9587DD;">)</span>,
        <span style="color: #9587DD;">padding</span>: <span style="color: #6bd9db;">Padding</span>,
        <span style="color: #9587DD;">stride</span>: <span style="color: #6bd9db;">usize</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">FullyConnected</span>,
    <span style="color: #6bd9db;">FullyConnectedD</span>,
    <span style="color: #6bd9db;">AvgPool</span> <span style="color: #9d81ba;">{</span>
        <span style="color: #9587DD;">pool_h</span>: <span style="color: #6bd9db;">usize</span>,
        <span style="color: #9587DD;">pool_w</span>: <span style="color: #6bd9db;">usize</span>,
        <span style="color: #9587DD;">stride</span>: <span style="color: #6bd9db;">usize</span>,
        <span style="color: #9587DD;">normalizer</span>: <span style="color: #6bd9db;">C</span>,
        <span style="color: #9587DD;">_variable</span>: <span style="color: #6bd9db;">PhantomData</span><span style="color: #9587DD;">&lt;</span><span style="color: #6bd9db;">F</span><span style="color: #9587DD;">&gt;</span>,
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #6bd9db;">Identity</span>,
<span style="color: #a0586c;">}</span>
</pre>
</div>

<p>
想查找哪些layer，请自己查。
</p>
</div>
</div>

<div id="outline-container-org9fe2f64" class="outline-4">
<h4 id="org9fe2f64"><span class="section-number-4">2.3.2.</span> tensors</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
tensors主要包括Input&lt;T&gt;和Output&lt;T&gt;两种范型，二者都是四维张量。
T的实例化一般就是share和AdditiveShare。
</p>

<p>
此处比较简单，故略
</p>
</div>
</div>
<div id="outline-container-orge6473cf" class="outline-4">
<h4 id="orge6473cf"><span class="section-number-4">2.3.3.</span> others</h4>
<div class="outline-text-4" id="text-2-3-3">
<ol class="org-ol">
<li>enum
<ol class="org-ol">
<li>EvalMethod, 其实就是device，是cpu还是cuda</li>
</ol></li>
<li>trait
<ol class="org-ol">
<li>Evaluate，相当于pytorch中的forward，包含两种函数，一个是在cpu上forward，另一个是cuda上</li>
</ol></li>
<li>struct
<ol class="org-ol">
<li>NeuralNetwork,包含一个layer的Vec，还有一个EvalMethod。包含以下函数：
<ol class="org-ol">
<li>validate，返回一个bool值，代表该神经网络是否有效前一层的输出是否贴合后一层的输入</li>
<li>from_numpy,给定npy文件的路径，读取得到神经网络模型中的所有参数</li>
<li>Ealuate trait实现</li>
</ol></li>
<li>NeuralArchitecture,包含Vec&lt;LayerInfo&lt;F,C&gt;&gt;，主要就是介绍神经网络的结构信息</li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgef52f77" class="outline-3">
<h3 id="orgef52f77"><span class="section-number-3">2.4.</span> protocols-sys</h3>
<div class="outline-text-3" id="text-2-4">
<p>
protocols-sys定义了完整的密钥交换协议系统。主要包括：
</p>
<ol class="org-ol">
<li>调用C++的加密解密服务</li>
<li>为神经网络层和输入输出定义加密解密的结构体，实现对应的流程</li>
</ol>
</div>

<div id="outline-container-org4c30e6e" class="outline-4">
<h4 id="org4c30e6e"><span class="section-number-4">2.4.1.</span> client_cg</h4>
<div class="outline-text-4" id="text-2-4-1">
<ol class="org-ol">
<li>struct &amp; enum
<ol class="org-ol">
<li>Conv2D,Fullyconnected, 二者都是包含了四个变量
<ol class="org-ol">
<li>Metadata:有关于该层神经网络的一些元信息，被C++侧定义</li>
<li>ClientFHE:同态加密的一些需求，如加密器，解密器等</li>
<li>ClientShares:顾名思义</li>
</ol></li>
<li>SealclientCG,上述两种中的一种</li>
</ol></li>
<li>trait
<ol class="org-ol">
<li>ClientCG,封装了上述结构体一些必须的操作，包括：
<ol class="org-ol">
<li>参数， 包括密钥、层信息、输入维度、输出维度等。</li>
<li>预处理</li>
<li>后处理</li>
<li>解密</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgf638af0" class="outline-4">
<h4 id="orgf638af0"><span class="section-number-4">2.4.2.</span> client_gen</h4>
<div class="outline-text-4" id="text-2-4-2">
<ol class="org-ol">
<li>struct
<ol class="org-ol">
<li>SealClientGen，仅包含一个参数，即上面提到的ClientFHE</li>
</ol></li>
<li>trait
<ol class="org-ol">
<li>ClientGen，trait，包含三个函数
<ol class="org-ol">
<li>new，略</li>
<li>triples_preprocess</li>
<li>triples_postprocess</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org9a3c853" class="outline-4">
<h4 id="org9a3c853"><span class="section-number-4">2.4.3.</span> key_share</h4>
<div class="outline-text-4" id="text-2-4-3">
<ol class="org-ol">
<li>struct
<ol class="org-ol">
<li><p>
KeyShare. KeyShare便是C++版里的SerialCT,其定义为：
</p>
<div class="org-src-container">
<pre class="src src-rust">    <span style="color: #C68EDE;">pub</span> <span style="color: #C68EDE;">struct</span> <span style="color: #6bd9db;">SerialCT</span> <span style="color: #a0586c;">{</span>
    <span style="color: #C68EDE;">pub</span> <span style="color: #9587DD;">inner</span>: *<span style="color: #C68EDE;">mut</span> ::<span style="color: #738FD7;">std</span>::<span style="color: #738FD7;">os</span>::<span style="color: #738FD7;">raw</span>::c_char,
    <span style="color: #C68EDE;">pub</span> <span style="color: #9587DD;">size</span>: <span style="color: #6bd9db;">u64</span>,
<span style="color: #a0586c;">}</span>
</pre>
</div></li>
</ol></li>
<li>trait
<ol class="org-ol">
<li>KeyShare,最主要的函数就是generate。该函数会基于密钥构建出一个包含了同态加密和解密的函数</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orge32a96d" class="outline-4">
<h4 id="orge32a96d"><span class="section-number-4">2.4.4.</span> server_cg</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
类似于client_cg,略
</p>
</div>
</div>
<div id="outline-container-org11f4848" class="outline-4">
<h4 id="org11f4848"><span class="section-number-4">2.4.5.</span> server_gen</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
类似于client_gen,略
</p>
</div>
</div>
<div id="outline-container-orgeacb509" class="outline-4">
<h4 id="orgeacb509"><span class="section-number-4">2.4.6.</span> others</h4>
<div class="outline-text-4" id="text-2-4-6">
<ol class="org-ol">
<li>struct
<ol class="org-ol">
<li><p>
SealCT: SerialCT的rust封装，其格式类似于：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #C68EDE;">pub</span> <span style="color: #C68EDE;">struct</span> <span style="color: #6bd9db;">SerialCT</span> <span style="color: #a0586c;">{</span>
    <span style="color: #C68EDE;">pub</span> <span style="color: #9587DD;">inner</span>: *<span style="color: #C68EDE;">mut</span> ::<span style="color: #738FD7;">std</span>::<span style="color: #738FD7;">os</span>::<span style="color: #738FD7;">raw</span>::c_char,
    <span style="color: #C68EDE;">pub</span> <span style="color: #9587DD;">size</span>: <span style="color: #6bd9db;">u64</span>,
<span style="color: #a0586c;">}</span>
</pre>
</div></li>
<li>包含如下函数： en(de)crypt_vec，顾名思义，加解密一个向量</li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3b1356e" class="outline-3">
<h3 id="org3b1356e"><span class="section-number-3">2.5.</span> protocols</h3>
<div class="outline-text-3" id="text-2-5">
<p>
关于通讯的一些东西，略
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Feb  3 14:59:27 2023</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2023-02-03 五 18:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
